#題庫_database

Q1 = {'name':'＜可愛女人＞',  #歌名
      'lyrics':'想要有直昇機/想要和妳飛到宇宙去/想要和妳融化在一起/融化在銀河裡',  #完整歌詞
      'Q':'想要有直昇機/想要和妳飛到宇宙去/想要和妳融化在一起/融化在★★裡',  #題目
      'ans':'銀河',  #正確答案
      'hint_a':'ㄧㄏ',  #注音提示 
      'hint_f':'銀★',  #一字提示中的字首提示
      'hint_l':'★河',  #一字提示中的字尾提示
      'f_ans':'星辰'}  #錯誤提示 #

Q2 = {'name':'＜黑色幽默＞',
      'lyrics':'你說/苦笑常常陪著你/在一起有點勉強/該不該現在休了我',
      'Q':'你說/苦笑常常陪著你/在一起有點★★/該不該現在休了我',
      'ans':'勉強',
      'hint_a':'ㄇㄑ',
      'hint_f':'勉★',
      'hint_l':'★強',
      'f_ans':'淒涼'}

Q3 = {'name':'＜龍捲風＞',
      'lyrics':'沒有妳以後/我靈魂失控/黑雲在降落/我被它拖著走',
      'Q':'沒有妳以後/我靈魂失控/★★在降落/我被它拖著走',
      'ans':'黑雲',
      'hint_a':'ㄏㄩ',
      'hint_f':'黑★',
      'hint_l':'★雲',
      'f_ans':'豪雨'}

Q4 = {'name':'＜簡單愛＞',
      'lyrics':'我想就這樣牽著妳的手不放開/愛能不能夠永遠單純沒有悲哀',
      'Q':'我想就這樣牽著妳的手不放開/愛能不能夠永遠單純沒有★★',
      'ans':'悲哀',
      'hint_a':'ㄅㄞ',
      'hint_f':'悲★',
      'hint_l':'★哀',
      'f_ans':'困難'}#

Q5 = {'name':'＜安靜＞',
      'lyrics':'你要我說多難堪/我根本不想分開/為什麼還要我用微笑來帶過',
      'Q':'你要我說多★★/我根本不想分開/為什麼還要我用微笑來帶過',
      'ans':'難堪',
      'hint_a':'ㄋㄎ',
      'hint_f':'難★',
      'hint_l':'★堪',
      'f_ans':'悲慘'}#

Q6 = {'name':'＜世界末日＞',
      'lyrics':'天灰灰/會不會/讓我忘了你是誰/夜越黑/夢違背/難追難回味',
      'Q':'天灰灰/會不會/讓我忘了你是誰/夜越黑/夢★★/難追難回味',
      'ans':'違背',
      'hint_a':'ㄨㄅ',
      'hint_f':'違★',
      'hint_l':'★背',
      'f_ans':'難追'}#

Q7 = {'name':'＜半島鐵盒＞',
      'lyrics':'為什麼這樣子/你看著我/說你已經決定/我拉不住你/他的手應該比我更暖',
      'Q':'為什麼這樣子/你看著我/說你已經★★/我拉不住你/他的手應該比我更暖',
      'ans':'決定',
      'hint_a':'ㄐㄉ',
      'hint_f':'決★',
      'hint_l':'★定',
      'f_ans':'情定'}

Q8 = {'name':'＜暗號＞',
      'lyrics':'我害怕你心碎沒人幫你擦眼淚/別管那是非/只要我們感覺對',
      'Q':'我害怕你心碎沒人幫你擦★★/別管那是非/只要我們感覺對',
      'ans':'眼淚',
      'hint_a':'ㄧㄌ',
      'hint_f':'眼★',
      'hint_l':'★淚',
      'f_ans':'淚水'}#

Q9 = {'name':'＜回到過去＞',
      'lyrics':'沉默支撐躍過陌生/靜靜看著凌晨黃昏/妳的身影/失去平衡/慢慢下沉',
      'Q':'沉默★★躍過陌生/靜靜看著凌晨黃昏/妳的身影/失去平衡/慢慢下沉',
      'ans':'支撐',
      'hint_a':'ㄓㄔ',
      'hint_f':'支★',
      'hint_l':'★撐',
      'f_ans':'疾行'}#

Q10 = {'name':'＜我不配＞',
      'lyrics':'妳臉上的情緒/在還原那場雨/這巷弄太過彎曲走不回故事裡',
      'Q':'妳臉上的情緒/在★★那場雨/這巷弄太過彎曲走不回故事裡',
      'ans':'還原',
      'hint_a':'ㄏㄏ',
      'hint_f':'還★',
      'hint_l':'★原',
      'f_ans':'演繹'}#

Q11 = {'name':'＜晴天＞',
      'lyrics':'颳風這天/我試過握著妳手/但偏偏/雨漸漸/大到我看妳不見',
      'Q':'★★這天/我試過握著妳手/但偏偏/雨漸漸/大到我看妳不見',
      'ans':'颳風',
      'hint_a':'ㄍㄈ',
      'hint_f':'颳★',
      'hint_l':'★風',
      'f_ans':'暴雨'}#

Q12 = {'name':'＜你聽得到＞',
      'lyrics':'我想我是太過依賴/在掛電話的剛才/堅持學單純的小孩/我捨不得離開',
      'Q':'我想我是太過依賴/在掛電話的剛才/堅持學單純的★★/我捨不得離開',
      'ans':'小孩',
      'hint_a':'ㄒㄏ',
      'hint_f':'小★',
      'hint_l':'★孩',
      'f_ans':'無賴'}#

Q13 = {'name':'＜她的睫毛＞',
      'lyrics':'她的睫毛/彎的嘴角/用眼神對我拍照/我戒不掉/她的微笑/洋溢幸福的味道',
      'Q':'她的睫毛/彎的★★/用眼神對我拍照/我戒不掉/她的微笑/洋溢幸福的味道',
      'ans':'嘴角',
      'hint_a':'ㄗㄐ',
      'hint_f':'嘴★',
      'hint_l':'★角',
      'f_ans':'眼角'}#

Q14 = {'name':'＜七里香＞',
      'lyrics':'我的愛溢出就像雨水/院子落葉/跟我的思念厚厚一疊/幾句是非/也無法將我的熱情冷卻',
      'Q':'我的愛溢出就像雨水/院子落葉/跟我的思念厚厚一疊/幾句★★/也無法將我的熱情冷卻',
      'ans':'是非',
      'hint_a':'ㄕㄈ',
      'hint_f':'是★',
      'hint_l':'★非',
      'f_ans':'誓言'}#

Q15 = {'name':'＜藉口＞',
      'lyrics':'就算是我不懂/能不能原諒我/請不要把分手/當作妳的請求',
      'Q':'就算是我不懂/能不能原諒我/請不要把分手/當作妳的★★',
      'ans':'請求',
      'hint_a':'ㄑㄑ',
      'hint_f':'請★',
      'hint_l':'★求',
      'f_ans':'渴求'}

Q16 = {'name':'＜擱淺＞',
      'lyrics':'我只能永遠讀著對白/讀著我給妳的傷害/我原諒不了我/就請妳當作我已不在',
      'Q':'我只能永遠讀著★★/讀著我給妳的傷害/我原諒不了我/就請妳當作我已不在',
      'ans':'對白',
      'hint_a':'ㄉㄅ',
      'hint_f':'對★',
      'hint_l':'★白',
      'f_ans':'訊息'}

Q17 = {'name':'＜軌跡＞',
      'lyrics':'如果說分手/是苦痛/的起點/那在終點之前/我願意再愛一遍',
      'Q':'如果說分手/是★★/的起點/那在終點之前/我願意再愛一遍',
      'ans':'苦痛',
      'hint_a':'ㄎㄊ',
      'hint_f':'苦★',
      'hint_l':'★痛',
      'f_ans':'死亡'}

Q18 = {'name':'＜斷了的弦＞',
      'lyrics':'我的感覺你已聽不見/你的轉變像斷掉的弦/再怎麼接音都不對',
      'Q':'我的感覺你已聽不見/你的轉變像★★的弦/再怎麼接音都不對',
      'ans':'斷掉',
      'hint_a':'ㄉㄉ',
      'hint_f':'斷★',
      'hint_l':'★掉',
      'f_ans':'變調'}

Q19 = {'name':'＜夜曲＞',
      'lyrics':'為妳彈奏蕭邦的夜曲/紀念我死去的愛情/而我為妳隱姓埋名/在月光下彈琴',
      'Q':'為妳彈奏蕭邦的夜曲/紀念我死去的★★/而我為妳隱姓埋名/在月光下彈琴',
      'ans':'愛情',
      'hint_a':'ㄞㄑ',
      'hint_f':'愛★',
      'hint_l':'★情',
      'f_ans':'動心'}#

Q20 = {'name':'＜楓＞',
      'lyrics':'緩緩飄落的楓葉像思念/我點燃燭火溫暖歲末的秋天/極光掠奪天邊/北風掠過想你的容顏/我把愛燒成了落葉',
      'Q':'緩緩飄落的楓葉像思念/我點燃燭火溫暖歲末的秋天/極光掠奪天邊/北風掠過想你的★★/我把愛燒成了落葉',
      'ans':'容顏',
      'hint_a':'ㄖㄧ',
      'hint_f':'容★',
      'hint_l':'★顏',
      'f_ans':'季節'}#

Q21 = {'name':'＜珊瑚海＞',
      'lyrics':'我們的愛(給的愛)/差異一直存在(回不來)/風中塵埃(等待)/竟累積成傷害',
      'Q':'我們的愛(給的愛)/差異一直存在(回不來)/風中塵埃(等待)/竟累積成★★',
      'ans':'傷害',
      'hint_a':'ㄕㄏ',
      'hint_f':'傷★',
      'hint_l':'★害',
      'f_ans':'無奈'}

Q22 = {'name':'＜千里之外＞',
      'lyrics':'故事在城外/濃霧散不開/看不清對白/妳聽不出來/風聲不存在/是我在感慨',
      'Q':'故事在城外/濃霧散不開/看不清對白/妳聽不出來/風聲不存在/是我在★★',
      'ans':'感慨',
      'hint_a':'ㄍㄎ',
      'hint_f':'感★',
      'hint_l':'★慨',
      'f_ans':'喟嘆'}#

Q23 = {'name':'＜退後＞',
      'lyrics':'我知道妳我都沒有錯/只是忘了怎麼退後/信誓旦旦給了承諾/卻被時間撲了空',
      'Q':'我知道妳我都沒有錯/只是忘了怎麼退後/信誓旦旦給了★★/卻被時間撲了空',
      'ans':'承諾',
      'hint_a':'ㄔㄋ',
      'hint_f':'承★',
      'hint_l':'★諾',
      'f_ans':'把握'}#

Q24 = {'name':'＜菊花台＞',
      'lyrics':'你的淚光/柔弱中帶傷/慘白的月彎彎勾住過往',
      'Q':'你的★★/柔弱中帶傷/慘白的月彎彎勾住過往',
      'ans':'淚光',
      'hint_a':'ㄌㄍ',
      'hint_f':'淚★',
      'hint_l':'★光',
      'f_ans':'眼眶'}#

Q25 = {'name':'＜不能說的秘密＞',
      'lyrics':'妳說把愛漸漸放下會走更遠/又何必去改變/已錯過的時間',
      'Q':'妳說把愛漸漸放下會走更遠/又何必去★★/已錯過的時間',
      'ans':'改變',
      'hint_a':'ㄍㄅ',
      'hint_f':'改★',
      'hint_l':'★變',
      'f_ans':'追隨'}#

Q26 = {'name':'＜我不配＞',                                                  
      'lyrics':'一頁頁不忍翻閱的情節/妳好累/妳默背/為我掉過幾次淚/多憔悴/而我心碎妳受罪/妳的美/我不配',
      'Q':'一頁頁不忍翻閱的情節/妳好累/妳默背/為我掉過幾次淚/多憔悴/而我心碎妳★★/妳的美/我不配',      
      'ans':'受罪',                                                              
      'hint_a':'ㄕㄗ',                                                                 
      'hint_f':'受★',                                                      
      'hint_l':'★罪',                                                  
      'f_ans':'追隨'}

Q27 = {'name':'＜青花瓷＞',                                                  
      'lyrics':'釉色渲染仕女圖韻味被私藏/而妳嫣然的一笑如含苞待放/妳的美一縷飄散/去到我去不了的地方',
      'Q':'釉色渲染★★圖韻味被私藏/而妳嫣然的一笑如含苞待放/妳的美一縷飄散/去到我去不了的地方',      
      'ans':'仕女',                                                              
      'hint_a':'ㄕㄋ',                                                                 
      'hint_f':'仕★',                                                      
      'hint_l':'★女',                                                  
      'f_ans':'市井'}#

Q28 = {'name':'＜彩虹＞',                                                  
      'lyrics':'妳要離開/我知道很簡單/妳說依賴/是我們的阻礙/就算放開/但能不能別沒收我的愛/當作我最後才明白',
      'Q':'妳要離開/我知道很簡單/妳說依賴/是我們的阻礙/就算★★/但能不能別沒收我的愛/當作我最後才明白',      
      'ans':'放開',                                                              
      'hint_a':'ㄈㄎ',                                                                 
      'hint_f':'放★',                                                      
      'hint_l':'★開',                                                  
      'f_ans':'離開'}

Q29 = {'name':'＜稻香＞',                                                  
      'lyrics':'笑一個吧/功成名就不是目的/讓自己快樂快樂這才叫做意義/童年的紙飛機/現在終於飛回我手裡',
      'Q':'笑一個吧/功成名就不是目的/讓自己快樂快樂這才叫做★★/童年的紙飛機/現在終於飛回我手裡',      
      'ans':'意義',                                                              
      'hint_a':'一一',                                                                 
      'hint_f':'意★',                                                      
      'hint_l':'★義',                                                  
      'f_ans':'道理'}#

Q30 = {'name':'＜給我一首歌的時間＞',                                                  
      'lyrics':'能不能給我一首歌的時間/緊緊的把那擁抱變成永遠/在我的懷裡妳不用害怕失眠/哦/如果妳想忘記我也能失憶',
      'Q':'能不能給我一首歌的時間/緊緊的把那擁抱變成永遠/在我的懷裡妳不用害怕失眠/哦/如果妳想忘記我也能★★',      
      'ans':'失憶',                                                              
      'hint_a':'ㄕㄧ',                                                                 
      'hint_f':'失★',                                                      
      'hint_l':'★憶',                                                  
      'f_ans':'放棄'}

Q31 = {'name':'＜說好的幸福呢＞',                                                  
      'lyrics':'妳的回話凌亂著/在這個時刻/我想起噴泉旁的白鴿/甜蜜散落了',
      'Q':'妳的回話凌亂著/在這個時刻/我想起噴泉旁的★★/甜蜜散落了',      
      'ans':'白鴿',                                                              
      'hint_a':'ㄅㄍ',                                                                 
      'hint_f':'白★',                                                      
      'hint_l':'★鴿',                                                  
      'f_ans':'百合'}

Q32 = {'name':'＜說了再見＞',                                                  
      'lyrics':'心/碎了一地/撿不回從前的心跳/身陷過去我無力逃跑',
      'Q':'心/碎了一地/撿不回從前的★★/身陷過去我無力逃跑',      
      'ans':'心跳',                                                              
      'hint_a':'ㄒㄊ',                                                                 
      'hint_f':'心★',                                                      
      'hint_l':'★跳',                                                  
      'f_ans':'情調'}

Q33 = {'name':'＜煙花易冷＞',                                                  
      'lyrics':'雨紛紛/舊故里草木深/我聽聞/妳始終一個人/斑駁的城門/盤踞著老樹根/石板上迴蕩的是/再等',
      'Q':'雨紛紛/舊故里草木深/我聽聞/妳始終一個人/斑駁的城門/盤踞著老★★/石板上迴蕩的是/再等',      
      'ans':'樹根',                                                              
      'hint_a':'ㄕㄍ',                                                                 
      'hint_f':'樹★',                                                      
      'hint_l':'★根',                                                  
      'f_ans':'綠藤'}

Q34 = {'name':'＜超人不會飛＞',                                                  
      'lyrics':'我的槍不會裝彈藥(彈藥)/所以放心不會有人倒(人倒)/我拍青蜂俠不需要替身/因為自信是我繪畫的顏料',
      'Q':'我的槍不會裝彈藥(彈藥)/所以放心不會有人倒(人倒)/我拍青蜂俠不需要替身/因為★★是我繪畫的顏料',      
      'ans':'自信',                                                              
      'hint_a':'ㄗㄒ',                                                                 
      'hint_f':'自★',                                                      
      'hint_l':'★信',                                                  
      'f_ans':'夢想'}#

Q35 = {'name':'＜Mine Mine＞',                                                  
      'lyrics':'沒有你的生活/我開始寫小說/好多畫面/好多靈感/我要把稿費都給你',
      'Q':'沒有你的生活/我開始寫小說/好多畫面/好多靈感/我要把★★都給你',      
      'ans':'稿費',                                                              
      'hint_a':'ㄍㄈ',                                                                 
      'hint_f':'稿★',                                                      
      'hint_l':'★費',                                                  
      'f_ans':'篇幅'}

Q36 = {'name':'＜公主病＞',
      'lyrics':'說一千遍愛你／這都不是問題／我用音樂來治你的公主病／要我打包自己／扮成Hello Kitty／那看起來就會有點問題',
      'Q':'說一千遍愛你／這都不是問題／我用音樂來治你的公主病／要我打包自己／扮成Hello Kitty／那看起來就會有點★★',
      'ans':'問題',
      'hint_a':'ㄨㄊ',
      'hint_f':'問★',
      'hint_l':'★題',
      'f_ans':'滑稽'}

Q37 = {'name':'＜你好嗎＞',
      'lyrics':'想知道你真的過得好嗎/没有我也許是種解脫/將思念穿梭在宇宙數千光年/悄悄到/你身邊',
      'Q':'想知道你真的過得好嗎/没有我也許是種★★/將思念穿梭在宇宙數千光年/悄悄到/你身邊',
      'ans':'解脫',
      'hint_a':'ㄐㄊ',
      'hint_f':'解★',
      'hint_l':'★脫',
      'f_ans':'釋懷'}#

Q38 = {'name':'＜明明就＞',
      'lyrics':'遠方傳來風笛/我只在意有你的消息/城堡為愛守著秘密/而我為你守著回憶',
      'Q':'遠方傳來風笛/我只在意有你的消息/★★為愛守著秘密/而我為你守著回憶',
      'ans':'城堡',
      'hint_a':'ㄔㄅ',
      'hint_f':'城★',
      'hint_l':'★堡',
      'f_ans':'士兵'}

Q39 = {'name':'＜愛你沒差＞',
      'lyrics':'喔/「對不起」/這句話/打亂了時區/喔/你要我/在最愛的時候/睡去/我越想越清醒',
      'Q':'喔/「對不起」/這句話/打亂了★★/喔/你要我/在最愛的時候/睡去/我越想越清醒',
      'ans':'時區',
      'hint_a':'ㄕㄑ',
      'hint_f':'時★',
      'hint_l':'★區',
      'f_ans':'情緒'}

Q40 = {'name':'＜紅塵客棧＞',
      'lyrics':'任武林誰領風騷我卻/只為妳/折腰/過荒村野橋/尋世外/古道/遠離人間塵囂/柳絮飄執子之手逍遙',
      'Q':'任武林誰領風騷我卻/只為妳/★★/過荒村野橋/尋世外/古道/遠離人間塵囂/柳絮飄執子之手逍遙',
      'ans':'折腰',
      'hint_a':'ㄓㄧ',
      'hint_f':'折★',
      'hint_l':'★腰',
      'f_ans':'狂嘯'}#

Q41 = {'name':'＜算什麼男人＞',
      'lyrics':'我的溫暖/你的冷漠/讓愛起霧了/如果愛心/畫在起霧/的窗是模糊/還是更清楚',
      'Q':'我的溫暖/你的冷漠/讓愛起霧了/如果愛心/畫在起霧/的窗是★★/還是更清楚',
      'ans':'模糊',
      'hint_a':'ㄇㄏ',
      'hint_f':'模★',
      'hint_l':'★糊',
      'f_ans':'虛無'}

Q42 = {'name':'＜聽見下雨的聲音＞',
      'lyrics':'愛在過境/緣分不停/誰在擔心/窗台上滴落的雨滴/輕敲著傷心/淒美而動聽',
      'Q':'愛在★★/緣分不停/誰在擔心/窗台上滴落的雨滴/輕敲著傷心/淒美而動聽',
      'ans':'過境',
      'hint_a':'ㄍㄐ',
      'hint_f':'過★',
      'hint_l':'★境',
      'f_ans':'過期'}

Q43 = {'name':'＜聽爸爸的話＞',
      'lyrics':'我受夠我的愛你比較多/也受夠你的愛沉默很久/承諾太多/多少會錯/你寧願難過也不要有結果',
      'Q':'我受夠我的愛你比較多/也受夠你的愛★★很久/承諾太多/多少會錯/你寧願難過也不要有結果',
      'ans':'沉默',
      'hint_a':'ㄔㄇ',
      'hint_f':'沉★',
      'hint_l':'★默',
      'f_ans':'消失'}

Q44 = {'name':'＜告白氣球＞',
      'lyrics':'你說你有點難追/想讓我知難而退/禮物不需挑最貴/只要香榭的落葉',
      'Q':'你說你有點難追/想讓我知難而退/禮物不需挑最貴/只要★★的落葉',
      'ans':'香榭',
      'hint_a':'ㄒㄒ',
      'hint_f':'香★',
      'hint_l':'★榭',
      'f_ans':'鄉間'}

Q45 = {'name':'＜不該＞',
      'lyrics':'錯過的★★怎麼買/誰都付不出來/或許我們學會釋懷/讓過去安靜下來',
      'Q':'錯過的★★怎麼買/誰都付不出來/或許我們學會釋懷/讓過去安靜下來',
      'ans':'時間',
      'hint_a':'ㄕㄐ',
      'hint_f':'時★',
      'hint_l':'★間',
      'f_ans':'情感'}

Q46 = {'name':'＜愛情廢柴＞',
      'lyrics':'你的離開/喊得太快/我的依賴/還在耍賴/眼淚打轉/轉不回來/你的笑容燦爛',
      'Q':'你的離開/喊得太快/我的依賴/還在耍賴/★★打轉/轉不回來/你的笑容燦爛',
      'ans':'眼淚',
      'hint_a':'ㄧㄌ',
      'hint_f':'眼★',
      'hint_l':'★淚',
      'f_ans':'思緒'}#

Q47 = {'name':'＜等你下課＞',
      'lyrics':'我唱這麽走心/卻走不進你心裡/在人來人往找尋著你/守護著你不求結局',
      'Q':'我唱這麽★★/卻走不進你心裡/在人來人往找尋著你/守護著你不求結局',
      'ans':'走心',
      'hint_a':'ㄗㄒ',
      'hint_f':'走★',
      'hint_l':'★心',
      'f_ans':'動聽'}#

Q48 = {'name':'＜不愛我就拉倒＞',
      'lyrics':'加速狂飆/你/你說不要/愛的險你不想冒/不想被我給套牢/反正我又不是沒有人要',
      'Q':'加速狂飆/你/你說不要/愛的險你不想冒/不想被我給★★/反正我又不是沒有人要',
      'ans':'套牢',
      'hint_a':'ㄊㄌ',
      'hint_f':'套★',
      'hint_l':'★牢',
      'f_ans':'打擾'}

Q49 = {'name':'＜說好不哭＞',
      'lyrics':'眼看著妳難過/挽留的話卻沒有說/妳會微笑放手/說好不哭讓我走',
      'Q':'眼看著妳難過/★★的話卻沒有說/妳會微笑放手/說好不哭讓我走',
      'ans':'挽留',
      'hint_a':'ㄨㄌ',
      'hint_f':'挽★',
      'hint_l':'★留',
      'f_ans':'安慰'}

Q50 = {'name':'＜Mojito＞',
      'lyrics':'沒有跟她笑容一樣濃郁的雪茄/就別浪費時間介紹收起來吧/拱廊的壁畫/舊城的塗鴉/所有色彩都因為她說不出話',
      'Q':'沒有跟她笑容一樣濃郁的雪茄/就別浪費時間介紹收起來吧/拱廊的壁畫/舊城的★★/所有色彩都因為她說不出話',
      'ans':'塗鴉',
      'hint_a':'ㄊㄧ',
      'hint_f':'塗★',
      'hint_l':'★鴉',
      'f_ans':'籬笆'}#

#-----以下為該模組中的自定義函數--請勿更動-------------------------------------------------------------------------------------------
def set_Qs():
    Q_list = [Q1,Q2,Q3,Q4,Q5,Q6,Q7,Q8,Q9,Q10,Q11,Q12,Q13,Q14,Q15,Q16,Q17,Q18,Q19,Q20,Q21,Q22,Q23,Q24,Q25,Q26,Q27,Q28,Q29,Q30,Q31,Q32,Q33,Q34,Q35,Q36,Q37,Q38,Q39,Q40,Q41,Q42,Q43,Q44,Q45,Q46,Q47,Q48,Q49,Q50]
    return Q_list
